/*
	arrayIO.h
*/

/*
	Бібліотека яка займається вводом виводом масиву
*/

/* для запобігання повторного підключення бібліотеки */
#ifndef ARRAYIO_H
#define ARRAYIO_H

/* підключаємо стандартні бібліотеки мови С */
#include <time.h>
/* підключаємо власні бібліотеки */
#include "elements.h"

//функція яка створює динамічні масиви
void createArr();

//функція яка звільнює пам'ять від масиву
void deleteArr();

/*************ФУНКЦІЇ ЯКІ ЗАПОВНЮЮТЬ МАСИВ (КУБ ЧИ ВЕКТОР)***********/
/*
Ця функція для того щоб заповнити увесь куб, так як за умовою сортування діагоналі
куба, ця функція особлива для куба
*/
void inputCube(int);
/* Фнкція яка займається заповненям масива впорядковано */
void inputOrderArray(int, const int, const int, const int, int);

/* Функція яка займається заповненям масива обернено впорядковано */
void inputBOrderArray(int, const int, const int, const int, int);

/* Функція яка займається заповненням масива випадково впорядковано */
void inputROrderArray(int, const int, int);
/********************************************************************/

/*************ФУНКЦІЯ ЯКА ВИВОДИТЬ МАСИВ (КУБ ЧИ ВЕКТОР) ************/
/* Функція яка виводить масив */
void outputArray(int);
/********************************************************************/

#endif
