/*
	elements.h
*/

/*
	Бібліотека у якій оголошені глобальні константи та змінні
*/

/* для запобігання повторного підключення бібліотеки */
#ifndef ELEMENTS_H
#define ELEMENTS_H

/* підключаємо стандартні бібліотеки мови С */
#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include <time.h>
#include <malloc.h>
#include <termios.h>
#include <unistd.h>

/* підключаємо сторонні бібліотеки із VS 2017 */
//#include <conio.h>
//#include <windows.h>

/* Функція яка замінює функція getch() у виндовс (код брався з інтернету) */
int getch_l();

/* змінні та константи для сортування кубів */ 
#define SIZE_P 32
#define SIZE_N 625

//ці константи для того щоб вивести не весь массив, для того щоб показати правильність сортування
#define SZ_P 3
#define SZ_N 5

/* змінні та константи для сортування векторів*/
#define SIZE 625

/* динамічні масиви для сортування */
extern int ***A; //динамічний трьохвимірний масив
extern int *B; //динамічний масив

//ця константа для того щоб вивести не весь массив, для того щоб показати правильність сортування
#define SZ 10

/* мод який визначає те що для демонстарації сортування заповнити масив малими числами */
#define DEMO 1
/* мод якщо на потрібно заповнити великими числами для виміру часу */
#define NO_DEMO 0

/* моди - перемикачі в функціях */
// типи масиву
#define VECTOR 2
#define CUBE 1

// типи	сортування
#define SI_1 1 // сортування вставкою №1
#define SS_8 2 // сортування вибору №8
#define SHELL 4 // сортування Шелла
#define QS 3 // сортування швидке
// типи відсортованості
#define ORDER 1 // впорядкований
#define B_ORDER 2 // обратно впорядкований 
#define R_ORDER 3 // випадково впорядкований


/* заданий наперед розмір масива для сортування Шелла, так як у VS немає стандарту С99 відповідно не підтримує масив змінної довжини як у паскалі,
   а динамічний масив і звільненя пам'яті займе час і відповідно поруше результати */
#define SS 2000

/* константа - розмір наступного масива */
#define MST_NUMBER 28

/* масив для отримання 28 значень часу сортування, щоб знайти середнє значення */
extern clock_t Res[MST_NUMBER];

/* константа для наступного масиву */
#define RES_SZ 24

/* масив отриманих результатів в результаті вирахування кожного варіанту */
extern float res_t[RES_SZ];

#endif
