/*
	main.c
*/

/*
	Точка запуска програми
*/

/*
	Курсовая работа студента КПІ ФПМ 1 курса Соколовського Б.М.
	група КВ-73, дисципліна СДА

	Трохи статистики: приблизно 1620 +- 10  строк кода всього
*/

/* подключаем собственные библиотеки */
#include "menu.h"
#include "arrayIO.h"

int ***A;
int *B;

/* Начало программы */
int main(void)
{
	/*
	наступні дві функції для того щоб не було проблем з пам'ятю
	наприклад якщо програма закрили примусово, а пам'ять від масиву
	не звільнили
	*/
	createArr();
	deleteArr();
	
	//ініціалізуємо динамічні масиви
	createArr();
	
	//викликаємо головне меню (починаємо роботу)
	mainMenu();

	//звільнаяємо пам'ять від динамічного масиву
	deleteArr();

	return 0;
}
